trade_exp/src/DataProcessors/ПечатьДоговораВWord/ПечатьДоговораВWord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьДоговораВWord</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1a4991f8-7832-4ca9-8809-88a97de88749">
  <name>ДокументыФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4f44c1c0-0480-415e-8058-41b28f2f43a0">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3b708ec7-6543-40ff-8ea2-16d4ddb7d56f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="433e502d-ab5c-4e8e-a7c0-0fde1aa6f767">
    <name>ДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6bd65f02-9531-4dd4-bd4a-4132aa3c4787">
    <name>СрокДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d9863e6-aab7-4808-a516-8bc42dae5d01">
    <name>КемВыдан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2910bb8-fdd2-480c-8ae2-78661d7d18e0">
    <name>КодПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="218302fa-674d-45e1-a7e2-2cce2d011342">
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="70264a0a-95c5-426f-a1bf-0f57b86d4030">
    <name>Представление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="cadcf4bd-2047-4fcb-b58e-bd6c09c5577a">
    <name>ФамилияЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e22a7536-dd59-4093-bfc8-335178b9da44">
    <name>ИмяЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="af40a979-1391-4411-b5a4-9f9a91fb8123">
    <name>СтранаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="365ca951-7fbf-4ad3-9004-47c3ef48b3bd">
    <name>КатегорииТранспортныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a231846e-d31a-4f94-9c9f-1e18d525af6c">
    <name>АдресПрописки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac3dc5c4-e172-49f9-b95f-4221e68f3600">
    <name>АдресПроживания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0495d913-3a33-41b9-9065-56d730c8fc56">
    <name>СовпадаетСПропиской</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="3291428e-6727-43cc-a1f8-c62f90320e90">
    <name>Физлицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d867720c-c937-4689-b241-0afda05ef993">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fef27478-ddfd-4ad9-8161-148761f29698">
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39cbda23-db3f-4ddd-8981-8540247406db">
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a6eb0cb1-80f0-4390-80ff-7af53f8e63c3">
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/БанковскиеСчетаОрганизаций/БанковскиеСчетаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>БанковскиеСчетаОрганизаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes extendedConfigurationObject="dfe34051-239d-4487-9094-f4621e4b1a0c">
    <name>Банк</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db8dbdae-bd94-4c57-8c2f-3511b1f4acfe">
    <name>НомерСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e013601b-9bfa-480e-b355-14301b81599d">
    <name>РучноеИзменениеРеквизитовБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c362f07b-b4db-485a-9818-b71e14166935">
    <name>БИКБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="88ac130f-656b-4263-8c23-b1e53fd938b6">
    <name>НаименованиеБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c3405837-0c7e-4977-9a1a-93ee77c6f0ab">
    <name>ГородБанка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="779c2ccc-8339-4a87-b8d3-19e79968205a">
    <name>ВалютаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e18ea73-6108-4a4b-b598-20468a528cbb">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5f5b288-1cc7-4bae-91bd-48b585786fc3">
    <name>РазделЛицевогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2770a3cc-c101-4c07-8767-0c341e456586">
    <name>ФайлВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ee12d8c-c72e-424c-9615-0694668b57c5">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1f687ac-281d-44b0-a05c-998d9209a79d">
    <name>ОбменСБанкомВключен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bc237e4-a584-4952-80c1-f5a32a29aaa7">
    <name>Кодировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="01041a33-be7f-4197-88ca-77f14d4e3e77">
    <name>ТипСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e38af342-d90f-477a-a337-90c6c82bddf3">
    <name>ЭтоIBAN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="82ee6ac6-bee0-43fd-a5cb-cd2e84fcca3b">
    <name>ОтдельныйСчетГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff6c7351-9571-4f62-b525-106f9d649c9a">
    <name>БанкДляРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="575f081a-d540-41d2-af17-2d6658a5b68b">
    <name>СчетВБанкеДляРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>34</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fc72a52-70ea-4a6a-a72c-0637a205de2d">
    <name>ФорматОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250ac7d2-eb1a-4fbe-907e-126a30402fa1">
    <name>ВариантВыводаМесяца</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a062a14-7654-43d0-a668-6238efd7f1b2">
    <name>ИспользоватьКаталогЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9dcc4c7d-ef98-498a-8035-69af8f6b0475">
    <name>СчетПоГосконтракту</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ecaa572-e8c6-41f4-82a5-d0db46a445a8">
    <name>ОсновнойБанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1ac36d4a-e70a-45df-b9d4-b960a2ebaba3">
    <name>НомерЛицевогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0839592d-ff33-4519-9179-42d4fa1f900a">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="99bef96d-0f9f-42dd-beb7-f84ed1b7d5c2">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f6f426a6-f2a0-48c7-b275-b5064b350d39">
    <name>РазрешитьПлатежиБезУказанияЗаявок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dda41bbe-1b34-4880-975d-752b90fb946b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ed0aefe-823f-4db0-9aaa-76cd52c3ca97">
    <name>СрокИсполненияПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6ae635dc-85ed-4132-bd1d-bb20490c0968">
    <name>ВыводитьСуммуБезКопеек</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d960835d-7c4e-4504-bf9f-3d17bcc1f603">
    <name>ИспользоватьКаталогВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="653ab4a8-654c-4354-b21f-61392f557924">
    <name>ФайлЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b2dbb70b-47eb-4790-83a8-f043ca45f75d">
    <name>ВерсияФорматаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="04e0a6e7-a492-49e2-ad5f-83f456907ee8">
    <name>Программа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПечатьДоговораВWord/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	Возврат Новый Структура("Данные,Макеты",
				ПолучитьДанныеОбъектаПоМакетам(МассивДокументов, МассивИменМакетов),
				ПолучитьМакетыИОписанияСекций(МассивИменМакетов));
	
КонецФункции

Функция ПолучитьДанныеОбъектаПоМакетам(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	РезультатЗапроса = ПолучитьДанныеДляПечати(МассивДокументов);
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеОбъектаПоМакетам = Новый Структура;
		ДанныеОбъекта = ПолучитьДанныеОбъектаПоВыборке(Выборка);
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ДанныеОбъекта);
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(Выборка.Ссылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	Возврат ДанныеПоВсемОбъектам;
	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов)
	
	Запрос = Новый Запрос();
    	
	ВыбСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ОГРН");
	Запрос.УстановитьПараметр("КонтрагентОГРН",ВыбСвойство);
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Договоры.Организация КАК Организация,
	               |	Договоры.БанковскийСчет КАК БанковскийСчет,
	               |	Договоры.Контрагент КАК Контрагент,
	               |	Договоры.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	               |	Договоры.Ссылка,
	               |	Договоры.ВидДоговора,
	               |	Договоры.ДатаОкончанияДействия,
	               |	Договоры.КоличествоДнейПросрочки,
	               |	Договоры.ДопустимаяСуммаЗадолженности,
	               |	Договоры.КонтактноеЛицо,
	               |	Договоры.ТипДоговора,
	               |	Договоры.Дата,
	               |	Договоры.НаименованиеДляПечати,
	               |	Договоры.Руководитель,
	               |	Договоры.Менеджер
	               |ПОМЕСТИТЬ Договоры
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК Договоры
	               |ГДЕ
	               |	Договоры.Ссылка В(&МассивОбъектов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(СчетаОрг.НомерСчета) КАК ОрганизацияНомерСчета,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаОрг.БИКБанка
	               |			ИНАЧЕ БанкиОрг.Код
	               |		КОНЕЦ) КАК ОрганизацияБИК,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаОрг.НаименованиеБанка + "" "" + СчетаОрг.ГородБанка
	               |			ИНАЧЕ БанкиОрг.Наименование + "" "" + БанкиОрг.Город
	               |		КОНЕЦ) КАК ОрганизацияБанк,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаОрг.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаОрг.КоррСчетБанка
	               |			ИНАЧЕ БанкиОрг.КоррСчет
	               |		КОНЕЦ) КАК ОрганизацияКоррСчет,
	               |	Организации.НаименованиеСокращенное КАК ОрганизацияНаименование,
	               |	МАКСИМУМ(Организации.ОГРН) КАК ОрганизацияОГРН,
	               |	МАКСИМУМ(Организации.ИНН) КАК ОрганизацияИНН,
	               |	МАКСИМУМ(Организации.КПП) КАК ОрганизацияКПП,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
	               |				ТОГДА АдресаОрг.Представление
	               |		КОНЕЦ) КАК ОрганизацияЮрАдрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации)
	               |				ТОГДА АдресаОрг.Представление
	               |		КОНЕЦ) КАК ОрганизацияПочтАдрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации)
	               |				ТОГДА АдресаОрг.Представление
	               |		КОНЕЦ) КАК ОрганизацияЭП,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаОрг.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации)
	               |				ТОГДА АдресаОрг.Представление
	               |		КОНЕЦ) КАК ОрганизацияФакс,
	               |	МАКСИМУМ(СчетаКонтр.НомерСчета) КАК КонтрагентНомерСчета,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаКонтр.БИКБанка
	               |			ИНАЧЕ БанкиКонтр.Код
	               |		КОНЕЦ) КАК КонтрагентБИК,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаКонтр.НаименованиеБанка + "" "" + СчетаКонтр.ГородБанка
	               |			ИНАЧЕ БанкиКонтр.Наименование + "" "" + БанкиКонтр.Город
	               |		КОНЕЦ) КАК КонтрагентБанк,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА СчетаКонтр.РучноеИзменениеРеквизитовБанка
	               |				ТОГДА СчетаКонтр.КоррСчетБанка
	               |			ИНАЧЕ БанкиКонтр.КоррСчет
	               |		КОНЕЦ) КАК КонтрагентКоррСчет,
	               |	Контрагенты.НаименованиеПолное КАК КонтрагентНаименование,
	               |	МАКСИМУМ(Контрагенты.ИНН) КАК КонтрагентИНН,
	               |	МАКСИМУМ(Контрагенты.КПП) КАК КонтрагентКПП,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	               |				ТОГДА АдресаКонтр.Представление
	               |		КОНЕЦ) КАК КонтрагентЮрАдрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента)
	               |				ТОГДА АдресаКонтр.Представление
	               |		КОНЕЦ) КАК КонтрагентПочтАдрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента)
	               |				ТОГДА АдресаКонтр.Представление
	               |		КОНЕЦ) КАК КонтрагентЭП,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаКонтр.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксКонтрагенты)
	               |				ТОГДА АдресаКонтр.Представление
	               |		КОНЕЦ) КАК КонтрагентФакс,
	               |	МАКСИМУМ(Договоры.Ссылка) КАК Ссылка,
	               |	МАКСИМУМ(Договоры.ВидДоговора) КАК ВидДоговора,
	               |	МАКСИМУМ(Контрагенты.ЮрФизЛицо) КАК ЮрФизЛицо,
	               |	МАКСИМУМ(Договоры.ДатаОкончанияДействия) КАК ДатаОкончанияДействия,
	               |	МАКСИМУМ(Договоры.КоличествоДнейПросрочки) КАК КоличествоДнейПросрочки,
	               |	МАКСИМУМ(Договоры.ДопустимаяСуммаЗадолженности) КАК ДопустимаяСуммаЗадолженности,
	               |	МАКСИМУМ(Договоры.КонтактноеЛицо.Наименование) КАК КонтактноеЛицоФИО,
	               |	МАКСИМУМ(Договоры.КонтактноеЛицо.ДолжностьПоВизитке) КАК КонтактноеЛицоДолжностьПоВизитке,
	               |	МАКСИМУМ(Договоры.КонтактноеЛицо.ДатаРождения) КАК КонтактноеЛицоДатаРождения,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА АдресаКонтЛица.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				ТОГДА АдресаКонтЛица.Представление
	               |		КОНЕЦ) КАК КонтактноеЛицоРегистрация,
	               |	МАКСИМУМ(ДокументыКонтЛиц.Представление) КАК КонтактноеЛицоПаспорт,
	               |	МАКСИМУМ(КонтрагентыДопРекв.Значение) КАК КонтрагентОГРН,
	               |	МАКСИМУМ(Договоры.ТипДоговора) КАК ТипДоговора,
	               |	МАКСИМУМ(Договоры.Дата) КАК ДоговорДатаОт,
	               |	МАКСИМУМ(Договоры.НаименованиеДляПечати) КАК ДоговорНаимДляПечати,
	               |	МАКСИМУМ(ОтветственныеЛицаОрганизаций.ФизическоеЛицо) КАК РуководительФИО,
	               |	МАКСИМУМ(ОтветственныеЛицаОрганизаций.Должность) КАК РуководительДолжность,
	               |	МАКСИМУМ(Договоры.Менеджер) КАК Менеджер,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ПользКонтИнф.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя)
	               |				ТОГДА ПользКонтИнф.Представление
	               |		КОНЕЦ) КАК МенеджерТелефон
	               |ИЗ
	               |	Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК СчетаОрг
	               |		ПО Договоры.БанковскийСчет = СчетаОрг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК БанкиОрг
	               |		ПО (СчетаОрг.Банк = БанкиОрг.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО Договоры.Организация = Организации.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК АдресаОрг
	               |		ПО Договоры.Организация = АдресаОрг.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаКонтрагентов КАК СчетаКонтр
	               |		ПО Договоры.БанковскийСчетКонтрагента = СчетаКонтр.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК БанкиКонтр
	               |		ПО (СчетаКонтр.Банк = БанкиКонтр.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО Договоры.Контрагент = Контрагенты.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК АдресаКонтр
	               |		ПО Договоры.Контрагент = АдресаКонтр.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК АдресаКонтЛица
	               |		ПО Договоры.КонтактноеЛицо = АдресаКонтЛица.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыКонтЛиц
	               |		ПО Договоры.КонтактноеЛицо = ДокументыКонтЛиц.Физлицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДопРекв
	               |		ПО Договоры.Контрагент = КонтрагентыДопРекв.Ссылка
	               |			И (КонтрагентыДопРекв.Свойство = &КонтрагентОГРН)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	               |		ПО Договоры.Руководитель = ОтветственныеЛицаОрганизаций.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользКонтИнф
	               |		ПО Договоры.Менеджер = ПользКонтИнф.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Организации.НаименованиеСокращенное,
	               |	Контрагенты.НаименованиеПолное";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПолучитьДанныеОбъектаПоВыборке(Выборка)
	
	ДанныеОбъекта = Новый Структура;
	
	ВставитьДанныеОбъекта(ДанныеОбъекта,"Ссылка", Выборка.Ссылка);
	
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияНаименование",Выборка.ОрганизацияНаименование);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияЮрАдрес",Выборка.ОрганизацияЮрАдрес);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияПочтАдрес",Выборка.ОрганизацияПочтАдрес);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияЭП",Выборка.ОрганизацияЭП);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияФакс",Выборка.ОрганизацияФакс);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияИНН",Выборка.ОрганизацияИНН);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияКПП",Выборка.ОрганизацияКПП);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияБИК",Выборка.ОрганизацияБИК);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияНомерСчета",Выборка.ОрганизацияНомерСчета);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияБанк",Выборка.ОрганизацияБанк);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияКоррСчет",Выборка.ОрганизацияКоррСчет);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентНаименование",Выборка.КонтрагентНаименование);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентАдрес",Выборка.КонтрагентЮрАдрес);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентПочтАдрес",Выборка.КонтрагентПочтАдрес);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентЭП",Выборка.КонтрагентЭП);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентФакс",Выборка.КонтрагентФакс);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентИНН",Выборка.КонтрагентИНН);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентКПП",Выборка.КонтрагентКПП);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентБИК",Выборка.КонтрагентБИК);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентНомерСчета",Выборка.КонтрагентНомерСчета);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентБанк",Выборка.КонтрагентБанк);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентКоррСчет",Выборка.КонтрагентКоррСчет);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияОГРН",Выборка.ОрганизацияОГРН);
    ВставитьДанныеОбъекта(ДанныеОбъекта,"ВидДоговора",Выборка.ВидДоговора);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ЮрФизЛицо",Выборка.ЮрФизЛицо);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ДатаОкончанияДействия",Формат(Выборка.ДатаОкончанияДействия,"ДЛФ=D"));
	
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КоличествоДнейПросрочки",Выборка.КоличествоДнейПросрочки);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КоличествоДнейПросрочкиПрописью",
							НРег(ЧислоПрописью(Выборка.КоличествоДнейПросрочки,
							"Л = ru_RU; ДП = Ложь; НП = Ложь; НД = Ложь;", ",,,,,,,,0")));
	
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ДопустимаяСуммаЗадолженности",Выборка.ДопустимаяСуммаЗадолженности);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ДопустимаяСуммаЗадолженностиПрописью",
	                      	ЧислоПрописью(Выборка.ДопустимаяСуммаЗадолженности,
						  	"Л = ru_RU; ДП = Ложь; НП = Истина; НД = Истина;",
						  	"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));
	
	Если Выборка.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидДоговора.ФедеральныйБюджет")
		Тогда ВставитьДанныеОбъекта(ДанныеОбъекта,"ВидБюджета","федерального");
	ИначеЕсли Выборка.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидДоговора.МестныйБюджет") 
		Тогда ВставитьДанныеОбъекта(ДанныеОбъекта,"ВидБюджета","местного"); 
	КонецЕсли;
	
	Если Выборка.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидДоговора.Транзитный")Тогда
		ВставитьДанныеОбъекта(ДанныеОбъекта,"СторонаДоговора","Поставщик");
		ВставитьДанныеОбъекта(ДанныеОбъекта,"НазваниеДоговора","Договор поставки");
	Иначе 
		ВставитьДанныеОбъекта(ДанныеОбъекта,"СторонаДоговора","Продавец");
		ВставитьДанныеОбъекта(ДанныеОбъекта,"НазваниеДоговора","Договор купли-продажи");
	КонецЕсли;
		
	//Область "Подвал"
	
 	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоДолжностьПоВизитке",Выборка.КонтактноеЛицоДолжностьПоВизитке);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоФИО",Выборка.КонтактноеЛицоФИО);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоДатаРождения",Формат(Выборка.КонтактноеЛицоДатаРождения,"ДЛФ=D"));
    ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоФИОСокр", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Выборка.КонтактноеЛицоФИО));
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоРегистрация",Выборка.КонтактноеЛицоРегистрация);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтактноеЛицоПаспорт",Выборка.КонтактноеЛицоПаспорт);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентОГРН",Выборка.КонтрагентОГРН);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"РуководительДолжность",Выборка.РуководительДолжность);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"РуководительФИО",Выборка.РуководительФИО);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"РуководительФИОСокр", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Выборка.РуководительФИО));
	                                                                                              
	//Область "Лист согласования"
	
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ДоговорНаимДляПечати",Выборка.ДоговорНаимДляПечати);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ОрганизацияНаименование",Выборка.ОрганизацияНаименование);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"КонтрагентНаименование",Выборка.КонтрагентНаименование);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"ДоговорДатаОт",Формат(Выборка.ДоговорДатаОт,"ДЛФ=D"));
	ВставитьДанныеОбъекта(ДанныеОбъекта,"Менеджер",Выборка.Менеджер);
	ВставитьДанныеОбъекта(ДанныеОбъекта,"МенеджерТелефон",Выборка.МенеджерТелефон);

	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ПолучитьМакетыИОписанияСекций(знач МассивИменМакетов) Экспорт
	
	ОписаниеСекций = Новый Структура;
	ДвоичныеДанныеМакетов = Новый Структура;
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		
		Макет = Неопределено;
		ОписаниеСекцийМакета = Неопределено;
		
		ОписаниеСекцийМакета = ПолучитьОписаниеОбластейДоговора();
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьДоговораВWord.ПФ_DOC_Договор");
				
		Если ОписаниеСекцийМакета <> Неопределено И Макет <> Неопределено Тогда
			
			ОписаниеСекций.Вставить(ИмяМакета, ОписаниеСекцийМакета);
			ДвоичныеДанныеМакетов.Вставить(ИмяМакета, Макет);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура(
						"ОписаниеСекций,ДвоичныеДанныеМакетов",
						ОписаниеСекций,
						ДвоичныеДанныеМакетов
					);
	
КонецФункции
				
Функция ПолучитьОписаниеОбластейДоговора()

	Секции = Новый Структура;
	
	
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "Заголовок",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "Бюджет",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "Предоплата",    "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "Отсрочка",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "Транзитный",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "ПодвалЮрЛицо",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "ПодвалИП",    "Общая");
	УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "ЛистСогласования",    "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(Секции, "НижнийКолонтитул",	"НижнийКолонтитул");
			
	Возврат Секции;

КонецФункции

Процедура ВставитьДанныеОбъекта(ДанныеОбъекта,ИмяПоля,ТекЗначение,ПустоеЗначение=" ")
	Если ЗначениеЗаполнено(ТекЗначение) Тогда
		НовоеЗначение=ТекЗначение;
	Иначе
		НовоеЗначение=ПустоеЗначение;
	КонецЕсли;
	
	ДанныеОбъекта.Вставить(ИмяПоля,НовоеЗначение);
КонецПроцедуры

 #КонецЕсли
